app/Http/Controllers/UserApiController.php

select * from `user_requests` where `user_requests`.`user_id` = 1 and `user_requests`.`user_rated` = 0 and `user_requests`.`status` = 'CANCELLED' and `updated_at` >= '2020-12-01 10:30:54' and `user_requests`.`deleted_at` is null order by `updated_at` desc limit 1
---

            if (empty($UserRequests)) {

                $cancelled_request = UserRequests::where('user_requests.user_id', Auth::user()->id)
                    ->where('user_requests.user_rated', 0)
                    ->where('user_requests.status', ['CANCELLED'])->orderby('updated_at', 'desc')
                    ->where('updated_at', '>=', \Carbon\Carbon::now()->subSeconds(5))
                    ->first();